NguyenQuangBinh803/MR-TMPM475-Driver-Board/TMPM475SBK/source/Libraries/TX04_Periph_Driver/src/tmpm475_can.c
    switch (INTTypeID) {
    case CAN_INT_TYPE_GLOBAL:
        /* Get global interrupt flag CANGIF */
        tmp = TSB_CAN->GIF;
        tmp &= GIF_INT_MASK;
        /* Clear global interrupt flag CANGIF */
        TSB_CAN->GIF = tmp;
        break;
    case CAN_INT_TYPE_TX:
        /* Get mailbox Tx interrupt flag CANMBTIF */
        tmp = TSB_CAN->MBTIF;
        tmp &= MBTIF_INT_MASK;
        /* Clear mailbox Tx interrupt flag CANMBTIF */
        TSB_CAN->MBTIF = tmp;
        break;
    case CAN_INT_TYPE_RX:
        /* Get mailbox Rx interrupt flag CANMBRIF */
        tmp = TSB_CAN->MBRIF;
        /* Clear mailbox Rx interrupt flag CANMBRIF */
        TSB_CAN->MBRIF = tmp;
        break;
    default:
        /* Do nothing */
        break;
    }
}

/**
  * @brief  Set the global or mailbox interrupt mask.
  * @param  INTMaskType: Select the global, mailbox transmission/receiving 
  *         interrupt intended to mask. This parameter can be one of the 
  *         following values:
  *         CAN_INT_GLOBAL_MASK, CAN_INT_MBX_MASK.
  * @param  INTMaskStruct: The structure used to enable or disable specified 
  *         interrupt. If the specified bit is set, the interrupt will be enabled.
  * @retval None.
  */
void CAN_SetINTMask(uint8_t INTMaskType, CAN_INTFactor * INTMaskStruct)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(CAN_INT_MASK_TYPE(INTMaskType));
    assert_param(IS_POINTER_NOT_NULL(INTMaskStruct));

    tmp = INTMaskStruct->All;
    if (INTMaskType == CAN_INT_GLOBAL_MASK) {
        /* Set global interrupt mask CANGIM */
        tmp &= GIF_INT_MASK;
        TSB_CAN->GIM = tmp;
    } else if (INTMaskType == CAN_INT_MBX_MASK) {
        /* Set mailbox interrupt mask CANMBIM */
        TSB_CAN->MBIM = tmp;
    } else {
        /* Do nothing */
    }
}

/** @} */
/* End of group CAN_Exported_Functions */

/** @} */
/* End of group CAN */

/** @} */
/* End of group TX03_Periph_Driver */

#endif                          /* defined(__TMPM369_CAN_H) */
